//------------------------------------------------------------------------------
//  此代码版权归作者本人若汝棋茗所有
//  源代码使用协议遵循本仓库的开源协议，若本仓库没有设置，则按MIT开源协议授权
//  CSDN博客：https://blog.csdn.net/qq_40374647
//  哔哩哔哩视频：https://space.bilibili.com/94253567
//  源代码仓库：https://gitee.com/RRQM_Home
//  交流QQ群：234762506
//  感谢您的下载和使用
//------------------------------------------------------------------------------
//------------------------------------------------------------------------------
//namespace RRQMSocket
//{
//    /*
//    若汝棋茗
//    */

//    /// <summary>
//    /// 服务器辅助类接口
//    /// </summary>
//    public interface ISocketClient
//    {
//        /// <summary>
//        /// 远程连接地址名
//        /// </summary>
//        string Name { get; }

//        /// <summary>
//        /// IPv4地址
//        /// </summary>
//        string IP { get; }

//        /// <summary>
//        /// 端口号
//        /// </summary>
//        int Port { get; }
//    }
//}